---
title: EditScope
classe: Autodesk.Revit.DB.EditScope
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# EditScope

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsActive { get; }` | `editScope.IsActive` | Boolean |
| `Boolean IsPermitted { get; }` | `editScope.IsPermitted` | Boolean |
| `Boolean IsValidObject { get; }` | `editScope.IsValidObject` | Boolean |
| `Void Cancel()` | `editScope.Cancel()` | Void |
| `Void Commit(IFailuresPreprocessor)` | `editScope.Commit(failurePreprocessor)` | Void |
| `Void Dispose()` | `editScope.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```